Revit 2027 API
BuiltInFailures.ToggleViewFailures Class
 Failures about ToggleView.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ToggleViewFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ToggleViewFailures
Public NotInheritable Class ToggleViewFailures
public ref class ToggleViewFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ToggleViewFailures = class end
The BuiltInFailures.ToggleViewFailures type exposes the following members.
Properties
Name | Description
LoseSavedOrientation |  The stored orientation will be lost.
Top
See Also
Reference
Autodesk.Revit.DB Namespace